app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "First Article - Edited - Editted by an admin"], ["updated_at", "2020-03-25 22:52:04.304417"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)